podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSCON_LPC82x.svd.xml
<!--
Devices using this peripheral: 
      LPC82x
-->
      <peripheral>
         <?sourceFile "SYSCON_LPC82x" ?>
         <name>SYSCON</name>
         <description>System configuration</description>
         <groupName>SYSCON</groupName>
         <headerStructName>SYSCON</headerStructName>
         <baseAddress>0x40048000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x70</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x80</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x94</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xE0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xF0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xFC</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x134</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x150</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x170</offset>
            <size>0x28</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x204</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x214</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x230</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x3F8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SYSMEMREMAP</name>
               <description>System memory remap</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x2</resetValue>
               <fields>
                  <field>
                     <name>MAP</name>
                     <description>System memory remap. Value 0x3 is reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BOOT_LOADER_MODE</name>
                           <description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_RAM_MODE</name>
                           <description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER_FLASH_MODE</name>
                           <description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRESETCTRL</name>
               <description>Peripheral reset control</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x1FFFF</resetValue>
               <fields>
                  <field>
                     <name>SPI0_RST_N</name>
                     <description>SPI0 reset control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_SPI0_RESE</name>
                           <description>Assert the SPI0 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_SPI0_RESET</name>
                           <description>Clear the SPI0 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPI1_RST_N</name>
                     <description>SPI1 reset control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_SPI1_RESE</name>
                           <description>Assert the SPI1 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_SPI1_RESET</name>
                           <description>Clear the SPI1 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UARTFRG_RST_N</name>
                     <description>USART fractional baud rate generator (UARTFRG) reset control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_UARTFRG_R</name>
                           <description>Assert the UARTFRG reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_UARTFRG_RE</name>
                           <description>Clear the UARTFRG reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART0_RST_N</name>
                     <description>USART0 reset control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_USART0_RE</name>
                           <description>Assert the USART0 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_USART0_RES</name>
                           <description>Clear the USART0 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART1_RST_N</name>
                     <description>USART1 reset control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_USART_RES</name>
                           <description>Assert the USART reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_USART1_RES</name>
                           <description>Clear the USART1 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART2_RST_N</name>
                     <description>USART2 reset control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_USART2_RE</name>
                           <description>Assert the USART2 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_USART2_RES</name>
                           <description>Clear the USART2 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C0_RST_N</name>
                     <description>I2C0 reset control</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_I2C0_RESE</name>
                           <description>Assert the I2C0 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_I2C0_RESET</name>
                           <description>Clear the I2C0 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MRT_RST_N</name>
                     <description>Multi-rate timer (MRT) reset control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_MRT_RESET</name>
                           <description>Assert the MRT reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_MRT_RESET</name>
                           <description>Clear the MRT reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCT_RST_N</name>
                     <description>SCT reset control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_SCT_RESET</name>
                           <description>Assert the SCT reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_SCT_RESET</name>
                           <description>Clear the SCT reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKT_RST_N</name>
                     <description>Self wake-up timer (WKT) reset control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_WKT_RESET</name>
                           <description>Assert the WKT reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_WKT_RESET</name>
                           <description>Clear the WKT reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPIO_RST_N</name>
                     <description>GPIO and GPIO pin interrupt reset control</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_GPIO_RESE</name>
                           <description>Assert the GPIO reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_GPIO_RESET</name>
                           <description>Clear the GPIO reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLASH_RST_N</name>
                     <description>Flash controller reset control</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_FLASH_CON</name>
                           <description>Assert the flash controller reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_FLASH_CONT</name>
                           <description>Clear the flash controller reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMP_RST_N</name>
                     <description>Analog comparator reset control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_ANALOG_CO</name>
                           <description>Assert the analog comparator reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_ANALOG_COM</name>
                           <description>Clear the analog comparator controller reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C1_RST_N</name>
                     <description>I2C1 reset control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_I2C1_RESE</name>
                           <description>Assert the I2C1 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_I2C1_RESET</name>
                           <description>Clear the I2C1 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C2_RST_N</name>
                     <description>I2C2 reset control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_I2C2_RESE</name>
                           <description>Assert the I2C2 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_I2C2_RESET</name>
                           <description>Clear the I2C2 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C3_RST_N</name>
                     <description>I2C3 reset control</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ASSERT_THE_I2C3_RESE</name>
                           <description>Assert the I2C3 reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_THE_I2C3_RESET</name>
                           <description>Clear the I2C3 reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCTRL</name>
               <description>System PLL control</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>MSEL</name>
                     <description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PSEL</name>
                     <description>Post divider ratio P. The division ratio is 2 x P</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>P_EQ_1</name>
                           <description>P = 1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_EQ_2</name>
                           <description>P = 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_EQ_4</name>
                           <description>P = 4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_EQ_8</name>
                           <description>P = 8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLSTAT</name>
               <description>System PLL status</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>PLL lock status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PLL_NOT_LOCKED</name>
                           <description>PLL not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL_LOCKED</name>
                           <description>PLL locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
