podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSCON_LPC82x.svd.xml
            <register>
               <name>SYSOSCCTRL</name>
               <description>System oscillator control</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>BYPASS</name>
                     <description>Bypass system oscillator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled. Oscillator is not bypassed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin bypassing the oscillator. Use this mode when using an external clock source instead of the crystal oscillator</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FREQRANGE</name>
                     <description>Determines oscillator frequency range</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>1__20_MHZ_FREQUENCY</name>
                           <description>1 - 20 MHz frequency range</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>15__25_MHZ_FREQUENC</name>
                           <description>15 - 25 MHz frequency range</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTOSCCTRL</name>
               <description>Watchdog oscillator control</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0xA0</resetValue>
               <fields>
                  <field>
                     <name>DIVSEL</name>
                     <description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FREQSEL</name>
                     <description>Select watchdog oscillator analog output frequency (Fclkana)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>0.6 MHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.05 MHz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.4 MHz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1.75 MHz</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>2.1 MHz</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>2.4 MHz</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>2.7 MHz</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>3.0 MHz</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>3.25 MHz</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>3.5 MHz</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>3.75 MHz</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>4.0 MHz</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>4.2 MHz</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>4.4 MHz</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>4.6 MHz</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRCCTRL</name>
               <description>IRC control</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>Trim value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSRSTSTAT</name>
               <description>System reset status register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>POR reset status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_POR_DETECTED</name>
                           <description>No POR detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POR_DETECTED</name>
                           <description>POR detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>Status of the external RESET pin. External reset status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_RESET_EVENT_DETEC</name>
                           <description>No reset event detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET_DETECTED</name>
                           <description>Reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Status of the Watchdog reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_WDT_RESET_DETECTE</name>
                           <description>No WDT reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_RESET_DETECTED</name>
                           <description>WDT reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOD</name>
                     <description>Status of the Brown-out detect reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BOD_RESET_DETECTE</name>
                           <description>No BOD reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOD_RESET_DETECTED</name>
                           <description>BOD reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSRST</name>
                     <description>Status of the software system reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_SYSTEM_RESET_DETE</name>
                           <description>No System reset detected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_RESET_DETECTE</name>
                           <description>System reset detected. Writing a one clears this reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCLKSEL</name>
               <description>System PLL clock source select</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>System PLL clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC</name>
                           <description>IRC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_OSCILLATOR</name>
                           <description>Crystal Oscillator (SYSOSC)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLKIN</name>
                           <description>CLKIN. External clock input</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCLKUEN</name>
               <description>System PLL clock source update enable</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable system PLL clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKSEL</name>
               <description>Main clock source select</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>Clock source for main clock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC Oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL_INPUT</name>
                           <description>PLL input</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WATCHDOG_OSCILLATOR</name>
                           <description>Watchdog oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLL_OUTPUT</name>
                           <description>PLL output</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKUEN</name>
               <description>Main clock source update enable</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable main clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKDIV</name>
               <description>System clock divider</description>
               <addressOffset>0x78</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>System AHB clock divider values 0: System clock disabled.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKCTRL</name>
               <description>System clock control</description>
               <addressOffset>0x80</addressOffset>
               <resetValue>0xDF</resetValue>
               <fields>
                  <field>
                     <name>SYS</name>
                     <description>Enables the clock for the AHB, the APB bridge, the Cortex-M0+ core clocks, SYSCON, and the PMU. This bit is read only and always reads as 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROM</name>
                     <description>Enables clock for ROM</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ROM" > <name>RAM0_1</name> <description>Enables clock for SRAM0 and SRAM1</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>FLASHREG</name> <description>Enables clock for flash register interface</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>FLASH</name> <description>Enables clock for flash</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>I2C0</name> <description>Enables clock for I2C0</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>GPIO</name> <description>Enables clock for GPIO port registers and GPIO pin interrupt</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SWM</name> <description>Enables clock for switch matrix</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SCT</name> <description>Enables clock for state configurable timer SCTimer/PWM</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>WKT</name> <description>Enables clock for self wake-up timer</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>MRT</name> <description>Enables clock for multi-rate timer</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SPI0</name> <description>Enables clock for SPI0</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SPI1</name> <description>Enables clock for SPI1</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CRC</name> <description>Enables clock for CRC</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>UART0</name> <description>Enables clock for USART0</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>UART1</name> <description>Enables clock for USART1</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>UART2</name> <description>Enables clock for USART2</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>WWDT</name> <description>Enables clock for WWDT</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>IOCON</name> <description>Enables clock for IOCON block</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>ACMP</name> <description>Enables clock to analog comparator</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>I2C1</name> <description>Enables clock to I2C1</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>I2C2</name> <description>Enables clock to I2C2</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>I2C3</name> <description>Enables clock to I2C3</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>ADC</name> <description>Enables clock to ADC</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>MTB</name> <description>Enables clock to micro- trace buffer control registers. Turn on this clock when using the micro-trace buffer for debug purposes</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>DMA</name> <description>Enables clock to DMA</description> <bitOffset>29</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>UARTCLKDIV</name>
               <description>USART clock divider</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>USART fractional baud rate generator clock divider values.  0: Clock disabled.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
