podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSCON_LPC82x.svd.xml
            <register>
               <name>CLKOUTSEL</name>
               <description>CLKOUT clock source select</description>
               <addressOffset>0xE0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>CLKOUT clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRYSTAL_OSCILLATOR</name>
                           <description>Crystal oscillator (SYSOSC)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WATCHDOG_OSCILLATOR</name>
                           <description>Watchdog oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTUEN</name>
               <description>CLKOUT clock source update enable</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable CLKOUT clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTDIV</name>
               <description>CLKOUT clock divider</description>
               <addressOffset>0xE8</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>CLKOUT clock divider values 0: Disable CLKOUT clock divider.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTFRGDIV</name>
               <description>USART1 to USART4 common fractional generator divider value</description>
               <addressOffset>0xF0</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTFRGMULT</name>
               <description>USART1 to USART4 common fractional generator multiplier value</description>
               <addressOffset>0xF4</addressOffset>
               <fields>
                  <field>
                     <name>MULT</name>
                     <description>Numerator of the fractional divider. MULT is equal to the programmed value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTTRACECMD</name>
               <description>External trace buffer command register</description>
               <addressOffset>0xFC</addressOffset>
               <fields>
                  <field>
                     <name>START</name>
                     <description>Trace start command. Writing a one to this bit sets the TSTART signal to the MTB to HIGH and starts tracing if the TSTARTEN bit in the MTB master register is set to one as well</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Trace stop command. Writing a one to this bit sets the TSTOP signal in the MTB to HIGH and stops tracing if the TSTOPEN bit in the MTB master register is set to one as well</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIOPORCAP0</name>
               <description>POR captured PIO status 0</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PIOSTAT</name>
                     <description>State of PIO0_17 through PIO0_0 at power-on reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCONCLKDIV6</name>
               <description>Peripheral clock 6 to the IOCON block for programmable glitch filter</description>
               <addressOffset>0x134</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>IOCON glitch filter clock divider values 0: Disable IOCONFILTR_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BODCTRL</name>
               <description>Brown-Out Detect</description>
               <addressOffset>0x150</addressOffset>
               <fields>
                  <field>
                     <name>BODRSTLEV</name>
                     <description>BOD reset level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_1</name>
                           <description>Level 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2</name>
                           <description>Level 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_3</name>
                           <description>Level 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BODRSTLEV" > <name>BODINTVAL</name> <description>BOD interrupt level</description> <bitOffset>2</bitOffset> </field>
                  <field>
                     <name>BODRSTENA</name>
                     <description>BOD reset enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_RESET_FUNCTI</name>
                           <description>Disable reset function</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_RESET_FUNCTIO</name>
                           <description>Enable reset function</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSTCKCAL</name>
               <description>System tick counter calibration</description>
               <addressOffset>0x154</addressOffset>
               <fields>
                  <field>
                     <name>CAL</name>
                     <description>System tick timer calibration value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>26</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQLATENCY</name>
               <description>IQR delay. Allows trade-off between interrupt latency and determinism</description>
               <addressOffset>0x170</addressOffset>
               <resetValue>0x10</resetValue>
               <fields>
                  <field>
                     <name>LATENCY</name>
                     <description>8-bit latency value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMISRC</name>
               <description>NMI Source Control</description>
               <addressOffset>0x174</addressOffset>
               <fields>
                  <field>
                     <name>IRQN</name>
                     <description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 is 1. See Table 3 for the list of interrupt sources and their IRQ numbers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NMIEN</name>
                     <description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PINTSEL0</name>
               <description>GPIO Pin Interrupt Select register 0</description>
               <addressOffset>0x178</addressOffset>
               <fields>
                  <field>
                     <name>INTPIN</name>
                     <description>Pin number select for pin interrupt or pattern match engine input. (PIO0_0 to PIO0_28 correspond to numbers 0 to 28)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,2,3,4,5,6,7</dimIndex>
               <name>PINTSEL%s</name>
               <description>GPIO Pin Interrupt Select register 0</description>
               <addressOffset>0x17C</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>INTPIN</name>
                     <description>Pin number select for pin interrupt or pattern match engine input. (PIO0_0 to PIO0_28 correspond to numbers 0 to 28)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STARTERP0</name>
               <description>Start logic 0 pin wake-up enable register</description>
               <addressOffset>0x204</addressOffset>
               <fields>
                  <field>
                     <name>PINT0</name>
                     <description>GPIO pin interrupt 0 wake-up</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PINT0" > <name>PINT1</name> <description>GPIO pin interrupt 1 wake-up</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT2</name> <description>GPIO pin interrupt 2 wake-up</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT3</name> <description>GPIO pin interrupt 3 wake-up</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT4</name> <description>GPIO pin interrupt 4 wake-up</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT5</name> <description>GPIO pin interrupt 5 wake-up</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT6</name> <description>GPIO pin interrupt 6 wake-up</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PINT0" > <name>PINT7</name> <description>GPIO pin interrupt 7 wake-up</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>STARTERP1</name>
               <description>Start logic 1 interrupt wake-up enable register</description>
               <addressOffset>0x214</addressOffset>
               <fields>
                  <field>
                     <name>SPI0</name>
                     <description>SPI0 interrupt wake-up</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="SPI0" > <name>SPI1</name> <description>SPI1 interrupt wake-up</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>USART0</name> <description>USART0 interrupt wake-up. Configure USART in synchronous slave mode</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>USART1</name> <description>USART1 interrupt wake-up. Configure USART in synchronous slave mode</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>USART2</name> <description>USART2 interrupt wake-up. Configure USART in synchronous slave mode</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>I2C1</name> <description>I2C1 interrupt wake-up</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>I2C0</name> <description>I2C0 interrupt wake-up</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>WWDT</name> <description>WWDT interrupt wake-up</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>BOD</name> <description>BOD interrupt wake-up</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>WKT</name> <description>Self wake-up timer interrupt wake-up</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>I2C2</name> <description>I2C2 interrupt wake-up</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SPI0" > <name>I2C3</name> <description>I2C3 interrupt wake-up</description> <bitOffset>22</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PDSLEEPCFG</name>
               <description>Power-down states in deep-sleep mode</description>
               <addressOffset>0x230</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>BOD_PD</name>
                     <description>BOD power-down control for Deep-sleep and Power-down mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BOD_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator power-down control for Deep-sleep and Power-down mode. Changing this bit to powered-down has no effect when the LOCK bit in the WWDT MOD register is set. In this case, the watchdog oscillator is always running</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PDAWAKECFG</name>
               <description>Power-down states for wake-up from deep-sleep</description>
               <addressOffset>0x234</addressOffset>
               <resetValue>0xEDF0</resetValue>
               <fields>
                  <field>
                     <name>IRCOUT_PD</name>
                     <description>IRC oscillator output wake-up configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IRCOUT_PD" > <name>IRC_PD</name> <description>IRC oscillator power-down wake-up configuration</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>FLASH_PD</name> <description>Flash wake-up configuration</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>BOD_PD</name> <description>BOD wake-up configuration</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ADC_PD</name> <description>ADC wake-up configuration</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSOSC_PD</name> <description>Crystal oscillator wake-up configuration</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator wake-up configuration. Changing this bit to powered-down has no effect when the LOCK bit in the WWDT MOD register is set. In this case, the watchdog oscillator is always running</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSPLL_PD</name> <description>System PLL wake-up configuration</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ACMP</name> <description>Analog comparator wake-up configuration</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
