podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SYSCON_LPC82x.svd.xml
            <register>
               <name>PDRUNCFG</name>
               <description>Power configuration register</description>
               <addressOffset>0x238</addressOffset>
               <resetValue>0xEDF0</resetValue>
               <fields>
                  <field>
                     <name>IRCOUT_PD</name>
                     <description>IRC oscillator output power</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>POWERED</name>
                           <description>Powered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERED_DOWN</name>
                           <description>Powered down</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="IRCOUT_PD" > <name>IRC_PD</name> <description>IRC oscillator power down</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>FLASH_PD</name> <description>Flash power down</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>BOD_PD</name> <description>BOD power down</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ADC_PD</name> <description>ADC wake-up configuration</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSOSC_PD</name> <description>Crystal oscillator power down. After power-up, add a software delay of approximately 500 us before using</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>WDTOSC_PD</name> <description>Watchdog oscillator power down. Changing this bit to powered-down has no effect when the LOCK bit in the WWDT MOD register is set. In this case, the watchdog oscillator is always running</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>SYSPLL_PD</name> <description>System PLL power down</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="IRCOUT_PD" > <name>ACMP</name> <description>Analog comparator power down</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>DEVICE_ID</name>
               <description>Device ID</description>
               <addressOffset>0x3F8</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DEVICEID</name>
                     <description>tbd</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
